In [40]:
#https://www.pythonsheets.com/notes/python-sqlalchemy.html

# Quiz

q-1-)Which component is an optional part of a CASE statement?
a-1->ELSE
Correct

ELSE is not required in a CASE statement.

Q-2-->What is the result of this query? 
 
 select coalesce('X', null, 'Z');
 
A-2-->X
Correct

The COALESCE() function returns the first non-null value from the set of inputs.

Q-3->What is the purpose of the NULLIF() function?

A-3-->It turns non-null values into null.

In [1]:
from sqlalchemy import create_engine
import pandas as pd
# connection string: driver://username:password@server/database
engine = create_engine('postgresql+psycopg2://postgres:password@localhost/two_three')

In [3]:
pd.read_sql_query('select * from inventory.products', engine).head(3)

      sku product_name  category_id  size  price
0  ALB008     Delicate            1     8  10.99
1  ALB032     Delicate            1    32  18.99
2  ALB064     Delicate            1    64  22.99

In [12]:
pd.read_sql_query(
    """
    SELECT 
        CASE
            WHEN 2=2 THEN 'A'
            WHEN 1=1 THEN 'B'
            ELSE 'C'
        END;
    """
    , engine)

  case
0    A

In [13]:
#CASE CAse = if WHEN -then , else=else
A=pd.read_sql_query(
        '''
select sku, product_name, category_id,
	case
		when category_id = 1 then 'Olive Oils'
		when category_id = 2 then 'Flavor Infused Oils'
		when category_id = 3 then 'Bath and Beauty'
		else 'category unknown'
	end as "category description",
	size, price
from inventory.products;

        ''', engine)#.sample(10)

In [17]:
#A.to_csv("try.csv")
A.sample(10)

,sku,product_name,category_id,category description,size,price
2,ALB064,Delicate,1,Olive Oils,64,22.99
60,PEN016,Pendolino,1,Olive Oils,16,14.99
80,REF016,Refined,1,Olive Oils,16,12.99
8,EV128,Extra Virgin,1,Olive Oils,128,24.99
43,MAN128,Manzanilla,1,Olive Oils,128,26.99
107,OGEC004,Olive Glow eye cream,3,Bath and Beauty,4,18.99
17,FR064,Frantoio,1,Olive Oils,64,22.99
104,JI008,Chili-Infused EVO,2,Flavor Infused Oils,8,11.99
19,HOJ008,Bold,1,Olive Oils,8,11.99
81,REF032,Refined,1,Olive Oils,32,16.99

In [23]:
#COALESCE
#merge columns with COLAESCe,skip null
pd.read_sql_query(
        '''
        SELECT COALESCE ('A','B','C');
        SELECT COALESCE (null,'B','C');
        ''', engine).head(2)

  coalesce
0        B

In [37]:
pd.read_sql_query(
    """
select * from inventory.categories;


    """
    , engine)

   category_id category_description  product_line
0            1           Olive Oils  Gourmet Chef
1            2  Flavor Infused Oils  Gourmet Chef
2            3      Bath and Beauty     Cosmetics

In [36]:
# delete A ROW
engine.execute("""
DELETE from inventory.categories where category_id=4;
""")

In [38]:
# insert a raw
engine.execute("""
insert into inventory.categories values(4, null, 'Gift Baskets');
""")

In [39]:
pd.read_sql_query(
    """
select * from inventory.categories;


    """
    , engine)

   category_id category_description  product_line
0            1           Olive Oils  Gourmet Chef
1            2  Flavor Infused Oils  Gourmet Chef
2            3      Bath and Beauty     Cosmetics
3            4                 None  Gift Baskets

In [41]:
##COALESCE
#NULL REPLACED WITH PRODUCT LINE
pd.read_sql_query(
    """
select category_id,
	coalesce(category_description, product_line) as "description",
	product_line
from inventory.categories;


    """
    , engine)

   category_id          description  product_line
0            1           Olive Oils  Gourmet Chef
1            2  Flavor Infused Oils  Gourmet Chef
2            3      Bath and Beauty     Cosmetics
3            4         Gift Baskets  Gift Baskets

In [45]:
#NULL IF
#TAKE 2 PARAMETER IF VALUES DIFFERENT RETURN FIRST ONE
#IF THE SAME RETUNR NONE
pd.read_sql_query(
    """
    SELECT NULLIF('A','B');
    SELECT NULLIF('A','A');
      """
    , engine)

  nullif
0   None

In [48]:
#add new column called size and replaced with NaN which size is 32
#CANARY VALUES-->
pd.read_sql_query(
    """
select * from inventory.products;

select sku, product_name, category_id,
    nullif(size, 32) as "size",
    price
from inventory.products;

      """
    , engine).head(10)

      sku      product_name  category_id   size  price
0  ALB008          Delicate            1    8.0  10.99
1  ALB032          Delicate            1    NaN  18.99
2  ALB064          Delicate            1   64.0  22.99
3  ALB128          Delicate            1  128.0  26.99
4   EV008      Extra Virgin            1    8.0   8.99
5   EV016      Extra Virgin            1   16.0  12.99
6   EV032      Extra Virgin            1    NaN  16.99
7   EV064      Extra Virgin            1   64.0  20.99
8   EV128      Extra Virgin            1  128.0  24.99
9  FCP008  First Cold Press            1    8.0   8.99